<template>
  <div class="wrapper">
    <section class="title_area">
      <h1>Бот-ассистент для разгребания предложений от рекрутеров</h1>
      <h2>Разгрузи свой поток входящих предложений о работе и выбери лучшие по твоим персональным критериям</h2>
    </section>
    <div class="columns">
    <div class="description">
      <h3>Описание </h3>
      <p>
      Не хочу никак обидеть тех кто в нынешние времена находится в поиске работы. Заранее приношу извенения если что-то в тексте может
      невзначай задеть.
      </p>
      <p> В то же время на квалифицированных специалистов, в первую очередь разработчиков и других специалистов задействованных в IT,
      в последнее время обрушился просто шквал предложений, контактов, сообщений от рекрутеров. Как показало несколько экспериментов,
      некоторые востребованные специалисты могут получать до 50 сообщений в день. Неудивительно что они просто перестают отвечать всем.
      </p>
      <p>Данный инструмент - попытка решить эту проблему. Специалист может настроить персональную страницу с важными для него параметрами,
      предложить рекрутерам заполнить их и потом раз в день или раз в неделю просматривать предложения отсортированные по собственным критериям
      и выбирать лучшие</p>
      <p> При этом сохраняется возможность следить за тем что происходит на рынке и получать интересные предложения и не тратить
      по часу в день на проматривание всех предложений
      </p>
      <p>Есть еще фишка - можно создавать свои категории (например район города или наличие курсов английского) и
      назначить им собственные веса. Что б получать результат четко настроенный под себя</p>
      <p>Рекрутерам придется возможно тратить больше времени на заполнение таких персональных форм, но сохраняется шанс что кандидат увидит
      ваше предложение, а не оно потонет в шуме
      </p>
    </div>
    <div class="howitworks">
      <h3>Как это работает</h3>
      <ol>
        <li>Создаете свою форму с нужными вам вопросами для описания вакансии. Например "зарплата", "продукт или аутсорс", "технологии", "опыт"</li>
        <li>Присваиваете веса каждой категории</li>
        <li>Генерируете ссылку на эту форму</li>
        <li>В линкедин и прочих социальных профилях где вам пишут рекрутеры публикуете ссылку с небольшим описанием
        "Если вы хотите предложить мне работу - заполните пожалуйста эту форму, так выше шанс что я отвечу"</li>
        <li>Те рекрутеры которые действительно хотят вам что-то предложить, а не работают по площадям, заходят, заполняют форму.
        Желательно что б там было 5-6 категорий, а не 15-20, давайте уважать друг друга</li>
        <li>Результаты взвешиваются пропорционально вашим весам и вы получаете отсортированный список который можете просмотреть
        раз в неделю или раз в день и сразу увидеть наиболее интересные предложения</li>
      </ol>
    </div>
    </div>
    <div class="controls">
      <el-button type="primary" @click="login">Попробовать, это бесплатно</el-button>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Home',
  props: {
  },
  methods: {
    login() {
      this.$router.push('/login');
    }
  }
}
</script>


<style scoped>
.wrapper {
  max-width: 1024px;
  margin: auto;
}
h1 {
  text-align: center;
  font-size:24px;
}
h2{
  text-align: center;
  font-size: 18px;
}
section {
  margin-bottom: 20px;
}
.description {
  margin: 20px;
  background: #fefefe;
  width: 50%;
}
.howitworks {
  margin: 20px;
  width: 50%;
}
.howitworks li {
  margin-bottom: 12px;
}
.columns {
  display: flex;
}
.controls  {
  display: flex;
  justify-content: center;
}
</style>
